#!/usr/bin/env python3
# -- coding: utf-8 --


# python已经内置列表
# list() 创建一个新的空列表。它不需要参数，而返回一个空列表。
# add(item) 将新项添加到列表，没有返回值。假设元素不在列表中。
# remove(item) 从列表中删除元素。需要一个参数，并会修改列表。此处假设元素在列表中。
# search(item) 搜索列表中的元素。需要一个参数，并返回一个布尔值。
# isEmpty() 判断列表是否为空。不需要参数，并返回一个布尔值。
# size() 返回列表的元素数。不需要参数，并返回一个整数。
# append(item) 在列表末端添加一个新的元素。它需要一个参数，没有返回值。假设该项目不在列表中。
# index(item) 返回元素在列表中的位置。它需要一个参数，并返回位置索引值。此处假设该元素原本在列表中。
# insert(pos,item) 在指定的位置添加一个新元素。它需要两个参数，没有返回值。假设该元素在列表中并不存在，并且列表有足够的长度满足参数提供的索引需要。
# pop() 从列表末端移除一个元素并返回它。它不需要参数，返回一个元素。假设列表至少有一个元素。
# pop(pos) 从指定的位置移除列表元素并返回它。它需要一个位置参数，并返回一个元素。假设该元素在列表中
